gianbartadougall/WatchDog-ESP32/STM32/Core/Src/watchdog.c
/**
 * @file watchdog.c
 * @author Gian Barta-Dougall ()
 * @brief
 * @version 0.1
 * @date 2023-01-30
 *
 * @copyright Copyright (c) 2023
 *
 */

/* C Library Includes */
#include <stdio.h>

/* Personal Includes */
#include "watchdog.h"
#include "ds18b20.h"
#include "hardware_config.h"
#include "log.h"
#include "comms_stm32.h"
#include "utils.h"
#include "chars.h"
#include "help.h"
#include "stm32_rtc.h"
#include "watchdog_defines.h"
#include "stm32_uart.h"

/* Private Macros */
#define ESP32_UART BUFFER_1_ID
#define MAPLE_UART BUFFER_2_ID
#define DEBUG

#define S0_READ_WATCHDOG_SETTINGS 1
#define S1_INIT_RTC               3
#define S2_SET_ALARM              4
#define S3_STM32_SLEEP            5
#define S4_RECORD_DATA            6
#define S5_SET_RTC_ALARM          7
#define S6_CHECK_INCOMING_REQUEST 8
#define S7_EXECUTE_REQUEST        9
#define S8_START_COUNT_DOWN       10
#define S9_STM32_WAKE             11

#define TIMEOUT         5000
#define COUNT_DOWN_TIME 5000

#define WATCHDOG_CODE_MESSAGE 0
#define WATCHDOG_CODE_TODO    1
#define WATCHDOG_CODE_ERROR   2

/* Private Variables */
dt_datetime_t datetime;

wd_camera_capture_time_settings_t captureTime = {
    .startTime.second    = 0,
    .startTime.minute    = 0,
    .startTime.hour      = 9,
    .endTime.second      = 0,
    .endTime.minute      = 0,
    .endTime.hour        = 15,
    .intervalTime.minute = 15,
    .intervalTime.hour   = 1,
};

uint8_t state          = S1_INIT_RTC;
uint8_t sleeping       = FALSE;
uint8_t esp32Connected = FALSE;

/* Function Prototypes */
void watchdog_esp32_on(void);
void watchdog_esp32_off(void);
void watchdog_send_bpacket_to_esp32(bpk_packet_t* Bpacket);
void watchdog_create_and_send_bpacket_to_esp32(const bpk_request_t Request, const bpk_code_t Code, uint8_t numBytes,
                                               uint8_t* data);
void watchdog_create_and_send_bpacket_to_maple(const bpk_request_t Request, const bpk_code_t Code, uint8_t numBytes,
                                               uint8_t* data);
uint8_t stm32_match_esp32_request(bpk_packet_t* Bpacket);
uint8_t stm32_match_maple_request(bpk_packet_t* Bpacket);
void process_watchdog_stm32_request(bpk_packet_t* Bpacket);
void watchdog_report_success(const bpk_request_t Request);
void watchdog_message_maple(char* string, bpk_code_t Code);
void watchdog_calculate_rtc_alarm_time(void);
void watchdog_request_esp32_take_photo(void);

void bpacket_print(bpk_packet_t* Bpacket) {
    char msg[BPACKET_BUFFER_LENGTH_BYTES + 2];
    sprintf(msg, "Receiver: %i Sender: %i Request: %i Code: %i Num bytes: %i", Bpacket->Receiver.val,
            Bpacket->Sender.val, Bpacket->Request.val, Bpacket->Code.val, Bpacket->Data.numBytes);
    log_message(msg);

    if (Bpacket->Data.numBytes > 0) {
        for (int i = 0; i < Bpacket->Data.numBytes; i++) {
            sprintf(msg, "%c", Bpacket->Data.bytes[i]);
            log_message(msg);
        }
    }
}

void watchdog_init(void) {

    // Initialise log
    log_init(uart_transmit_string, NULL);

    log_clear();

    // Initialise all the peripherals
    ds18b20_init();     // Temperature sensor
    comms_stm32_init(); // Bpacket communications between Maple and EPS32

    // Set the datetime to 12am 1 January 2023
    datetime.Date.year   = 23;
    datetime.Date.month  = 2;
    datetime.Date.day    = 10;
    datetime.Time.hour   = 7;
    datetime.Time.minute = 54;
    datetime.Time.second = 0;
    stm32_rtc_write_datetime(&datetime);

    // Turn the ESP32 on
    watchdog_esp32_on();

    // Get the capture time and resolution settings from the ESP32
    watchdog_message_maple("Reading watchdog settings\r\n", BPK_Code_Debug);
    watchdog_create_and_send_bpacket_to_esp32(BPK_WD_Request_Get_Capture_Time_Settings, BPK_Code_Execute, 0, NULL);
}

void watchdog_rtc_alarm_triggered(void) {
    state = S4_RECORD_DATA;
}

void watchdog_enter_state_machine(void) {

    while (1) {

        switch (state) {

            case S1_INIT_RTC:;
                // watchdog_message_maple("Initialising RTC\r\n", BPK_Code_Debug);

                // Set the RTC time
                dt_datetime_t initDateTime;
                dt_date_init(&initDateTime.Date, 1, 1, 2023);
                dt_time_init(&initDateTime.Time, 0, 59, 8);
                stm32_rtc_write_datetime(&initDateTime);

                dt_datetime_t initAlarmDate;
                dt_date_init(&initAlarmDate.Date, 1, 1, 2023);
                dt_time_init(&initAlarmDate.Time, 0, 0, 9);
                stm32_rtc_set_alarmA(&initAlarmDate);

                state = S2_SET_ALARM;
                break;

            case S2_SET_ALARM:
                // watchdog_message_maple("Setting alarm\r\n", BPK_Code_Debug);

                // TODO: Set the alarm on the RTC

                // Check if there were any requests
                if (comms_stm32_request_pending(MAPLE_UART) == TRUE) {
                    state = S7_EXECUTE_REQUEST;
                } else {
                    state = S3_STM32_SLEEP;
                }

                break;

            case S3_STM32_SLEEP:
                if (sleeping != TRUE) {
                    // watchdog_message_maple("Sleeping\r\n", BPK_Code_Debug);
                    sleeping = TRUE;
                }

                // TODO: Set stm32 to sleep

                if ((comms_stm32_request_pending(MAPLE_UART) == TRUE) ||
                    (comms_stm32_request_pending(ESP32_UART) == TRUE)) {
                    state    = S7_EXECUTE_REQUEST;
                    sleeping = FALSE;
                    // watchdog_message_maple("Waking up\r\n", BPK_Code_Debug);
                }

                break;

            case S4_RECORD_DATA:

                watchdog_request_esp32_take_photo();

                state = S3_STM32_SLEEP;

                break;

            case S5_SET_RTC_ALARM:;

                watchdog_message_maple("Upating RTC Alarm\r\n", BPK_Code_Debug);
                watchdog_calculate_rtc_alarm_time();

                state = S6_CHECK_INCOMING_REQUEST;

                break;

            case S6_CHECK_INCOMING_REQUEST:
                // watchdog_message_maple("Checking incoming requests\r\n", BPK_Code_Debug);

                if (comms_stm32_request_pending(MAPLE_UART) == TRUE) {
                    state = S7_EXECUTE_REQUEST;
                } else {
                    state = S3_STM32_SLEEP;
                }

                break;

